# Series
* pandas.Series* 
class pandas.Series(data=None, index=None, dtype=None, name=None, copy=None, fastpath=False

In [2]:
import pandas as pd

In [3]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d, index=['a', 'b', 'c'])
ser

a    1
b    2
c    3
dtype: int64

In [4]:
d = {'a': 1, 'b': 2, 'c': 3}
ser = pd.Series(data=d)
ser

a    1
b    2
c    3
dtype: int64

In [7]:
pd.Series(d, index=['A', 'B', 'C'])

A   NaN
B   NaN
C   NaN
dtype: float64

In [10]:
d1 = [1,2,3]
ser1 = pd.Series(d1, index = ['A', 'B', 'C'])

In [11]:
ser1.index

Index(['A', 'B', 'C'], dtype='object')

In [13]:
ser1.T

A    1
B    2
C    3
dtype: int64

In [18]:
fruits = ['apples', 'oranges', 'cherries', 'pears']
quantities = [20, 33, 52, 10]
ser2 = pd.Series(quantities, index = fruits)
print(ser2)
print(ser2.index)

apples      20
oranges     33
cherries    52
pears       10
dtype: int64
Index(['apples', 'oranges', 'cherries', 'pears'], dtype='object')

In [29]:
fruits = ['apples', 'oranges', 'cherries', 'pears']
quantities1 = [20, 33, 52, 10]
quantities2 = [9, 99, 2, 27]
ser3 = pd.Series(quantities2, index = fruits)
ser2 + ser3

apples       29
oranges     132
cherries     54
pears        37
dtype: int64

In [28]:
ser2 * ser3

apples       180
oranges     3267
cherries     104
pears        270
dtype: int64

In [30]:
fruits2 = ['raspberries', 'oranges', 'cherries', 'pears']
quantities = [20, 33, 52, 10]
ser2 = pd.Series(quantities, index = fruits2)
print(ser2)
print(ser2.index)

raspberries    20
oranges        33
cherries       52
pears          10
dtype: int64
Index(['raspberries', 'oranges', 'cherries', 'pears'], dtype='object')

In [31]:
ser2 + ser3

apples           NaN
cherries        54.0
oranges        132.0
pears           37.0
raspberries      NaN
dtype: float64

In [32]:
fruits2 = ['raspberries', 'oranges', 'cherries', 'pears']
fruits_tr = ['elma', 'portakal', 'kiraz', 'armut']
ser4 = pd.Series(quantities2, index = fruits_tr)
ser3 + ser4

apples     NaN
armut      NaN
cherries   NaN
elma       NaN
kiraz      NaN
oranges    NaN
pears      NaN
portakal   NaN
dtype: float64

#### Indexing

In [34]:
ser2['oranges']

33

In [37]:
ser2[['oranges', 'pears']]

oranges    33
pears      10
dtype: int64

In [42]:
ser4['portakal':'armut']

portakal    99
kiraz        2
armut       27
dtype: int64

In [44]:
import numpy as np
print((ser2 +1)*4 )

raspberries     84
oranges        136
cherries       212
pears           44
dtype: int64

In [45]:
print(np.sin(ser3))

apples      0.412118
oranges    -0.999207
cherries    0.909297
pears       0.956376
dtype: float64

#### pandas.Series.apply
* Series.apply(func, convert_dtype=True, args=(), **kwargs)

In [48]:
s = pd.Series([30, 21, 12],
              index=['Andong', 'New York', 'Helsinki'])

In [49]:
def square(x):
    return x ** 2
s.apply(square)

Andong      900
New York    441
Helsinki    144
dtype: int64

In [50]:
s.apply(lambda x: x**2)

Andong      900
New York    441
Helsinki    144
dtype: int64

In [52]:
s.apply(np.sqrt)

Andong      5.477226
New York    4.582576
Helsinki    3.464102
dtype: float64

#### Create Series from dict

In [58]:
cities = {"London": 8615246,
"Berlin": 3562166,
"Madrid": 3165235,
"Rome": 2874038,
"Paris": 2273305,
"Vienna": 1805681,
"Bucharest": 1803425,
"Hamburg": 1760433,
"Budapest": 1754000,
"Warsaw": 1740119,
"Barcelona": 1602386,
"Munich": 1493900,
"Milan": 1350680}
city_series = pd.Series(cities)
city_series

London       8615246
Berlin       3562166
Madrid       3165235
Rome         2874038
Paris        2273305
Vienna       1805681
Bucharest    1803425
Hamburg      1760433
Budapest     1754000
Warsaw       1740119
Barcelona    1602386
Munich       1493900
Milan        1350680
dtype: int64

#### NaN - Missing Data

In [61]:
my_cities = ["London", "Paris", "Zurich", "Berlin",
"Stuttgart", "Hamburg"]
my_city_series = pd.Series(cities, index = my_cities)
my_city_series

London       8615246.0
Paris        2273305.0
Zurich             NaN
Berlin       3562166.0
Stuttgart          NaN
Hamburg      1760433.0
dtype: float64

* isnull and notnull

In [62]:
my_city_series.isnull()

London       False
Paris        False
Zurich        True
Berlin       False
Stuttgart     True
Hamburg      False
dtype: bool

In [63]:
my_city_series.notnull()

London        True
Paris         True
Zurich       False
Berlin        True
Stuttgart    False
Hamburg       True
dtype: bool

In [65]:
my_city_series.isnull().sum()

2

In [66]:
my_city_series.dropna()

London     8615246.0
Paris      2273305.0
Berlin     3562166.0
Hamburg    1760433.0
dtype: float64

In [67]:
my_city_series.fillna(0)

London       8615246.0
Paris        2273305.0
Zurich             0.0
Berlin       3562166.0
Stuttgart          0.0
Hamburg      1760433.0
dtype: float64

In [68]:
my_city_series.fillna('None')

London       8615246.0
Paris        2273305.0
Zurich            None
Berlin       3562166.0
Stuttgart         None
Hamburg      1760433.0
dtype: object

# Data Frame

#### pandas.concat*
pandas.concat(objs, *, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=None)

In [72]:
years = range(2014, 2018)
shop1 = pd.Series([2409.14, 2941.01, 3496.83, 3119.55], index=years)
shop2 = pd.Series([1203.45, 3441.62, 3007.83, 3619.53], index=years)
shop3 = pd.Series([3412.12, 3491.16, 3457.19, 1963.10], index=years)
pd.concat([shop1, shop2, shop3], axis = 0)

2014    2409.14
2015    2941.01
2016    3496.83
2017    3119.55
2014    1203.45
2015    3441.62
2016    3007.83
2017    3619.53
2014    3412.12
2015    3491.16
2016    3457.19
2017    1963.10
dtype: float64

In [74]:
shop_df = pd.concat([shop1, shop2, shop3], axis = 1)
shop_df

            0        1        2
2014  2409.14  1203.45  3412.12
2015  2941.01  3441.62  3491.16
2016  3496.83  3007.83  3457.19
2017  3119.55  3619.53  1963.10

In [75]:
shop_df.columns

RangeIndex(start=0, stop=3, step=1)

In [77]:
shop_df.index

RangeIndex(start=2014, stop=2018, step=1)

In [78]:
shop_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 2014 to 2017
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
dtypes: float64(3)
memory usage: 228.0 bytes

In [79]:
shop_df.describe()

                 0            1            2
count     4.000000     4.000000     4.000000
mean   2991.632500  2818.107500  3080.892500
std     452.197431  1106.670582   745.897884
min    2409.140000  1203.450000  1963.100000
25%    2808.042500  2556.735000  3049.865000
50%    3030.280000  3224.725000  3434.655000
75%    3213.870000  3486.097500  3465.682500
max    3496.830000  3619.530000  3491.160000

#### pandas.DataFrame*
class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)

In [92]:
cities = {"name": ["London", "Berlin", "Madrid", "Rome",
            "Paris", "Vienna", "Bucharest", "Hamburg",
            "Budapest", "Warsaw", "Barcelona",
            "Munich", "Milan"],
            "population": [8615246, 3562166, 3165235, 2874038,
            2273305, 1805681, 1803425, 1760433,
            1754000, 1740119, 1602386, 1493900,
            1350680],
            "country": ["England", "Germany", "Spain", "Italy",
            "France", "Austria", "Romania",
            "Germany", "Hungary", "Poland", "Spain",
            "Germany", "Italy"]}

In [93]:
city_df = pd.DataFrame(cities, index = cities['name'])

In [94]:
city_df

                name  population  country
London        London     8615246  England
Berlin        Berlin     3562166  Germany
Madrid        Madrid     3165235    Spain
Rome            Rome     2874038    Italy
Paris          Paris     2273305   France
Vienna        Vienna     1805681  Austria
Bucharest  Bucharest     1803425  Romania
Hamburg      Hamburg     1760433  Germany
Budapest    Budapest     1754000  Hungary
Warsaw        Warsaw     1740119   Poland
Barcelona  Barcelona     1602386    Spain
Munich        Munich     1493900  Germany
Milan          Milan     1350680    Italy

In [95]:
ordinals = ["first", "second", "third", "fourth",
"fifth", "sixth", "seventh", "eigth",
"ninth", "tenth", "eleventh", "twelvth",
"thirteenth"]
city_df = pd.DataFrame(cities, index = ordinals)
city_df

                 name  population  country
first          London     8615246  England
second         Berlin     3562166  Germany
third          Madrid     3165235    Spain
fourth           Rome     2874038    Italy
fifth           Paris     2273305   France
sixth          Vienna     1805681  Austria
seventh     Bucharest     1803425  Romania
eigth         Hamburg     1760433  Germany
ninth        Budapest     1754000  Hungary
tenth          Warsaw     1740119   Poland
eleventh    Barcelona     1602386    Spain
twelvth        Munich     1493900  Germany
thirteenth      Milan     1350680    Italy

In [101]:
columns_name = ["name", "country", "population", "countryfwef"]
city_df = pd.DataFrame(cities, index = ordinals, columns=columns_name)
city_df.head()

          name  country  population countryfwef
first   London  England     8615246         NaN
second  Berlin  Germany     3562166         NaN
third   Madrid    Spain     3165235         NaN
fourth    Rome    Italy     2874038         NaN
fifth    Paris   France     2273305         NaN

In [99]:
data = [("a",1), ("b",2)]
pd.DataFrame(data)

   0  1
0  a  1
1  b  2

In [102]:
city_df.tail()

                 name  country  population countryfwef
ninth        Budapest  Hungary     1754000         NaN
tenth          Warsaw   Poland     1740119         NaN
eleventh    Barcelona    Spain     1602386         NaN
twelvth        Munich  Germany     1493900         NaN
thirteenth      Milan    Italy     1350680         NaN

In [103]:
city_df.head(3)

          name  country  population countryfwef
first   London  England     8615246         NaN
second  Berlin  Germany     3562166         NaN
third   Madrid    Spain     3165235         NaN

In [104]:
city_df["name"]

first            London
second           Berlin
third            Madrid
fourth             Rome
fifth             Paris
sixth            Vienna
seventh       Bucharest
eigth           Hamburg
ninth          Budapest
tenth            Warsaw
eleventh      Barcelona
twelvth          Munich
thirteenth        Milan
Name: name, dtype: object

In [106]:
city_df["male-population"] = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

In [107]:
city_df.head()

          name  country  population countryfwef  male-population
first   London  England     8615246         NaN                1
second  Berlin  Germany     3562166         NaN                2
third   Madrid    Spain     3165235         NaN                3
fourth    Rome    Italy     2874038         NaN                4
fifth    Paris   France     2273305         NaN                5

#### pandas.Series.rename*
Series.rename(index=None, *, axis=None, copy=None, inplace=False, level=None, errors='ignore')

In [108]:
city_df.rename(columns= {'name' : 'a',
                         'country' : 'b',
                         'population': 'c'
                        }, inplace= True)

In [109]:
city_df

                    a        b        c countryfwef  male-population
first          London  England  8615246         NaN                1
second         Berlin  Germany  3562166         NaN                2
third          Madrid    Spain  3165235         NaN                3
fourth           Rome    Italy  2874038         NaN                4
fifth           Paris   France  2273305         NaN                5
sixth          Vienna  Austria  1805681         NaN                6
seventh     Bucharest  Romania  1803425         NaN                7
eigth         Hamburg  Germany  1760433         NaN                8
ninth        Budapest  Hungary  1754000         NaN                9
tenth          Warsaw   Poland  1740119         NaN               10
eleventh    Barcelona    Spain  1602386         NaN               11
twelvth        Munich  Germany  1493900         NaN               12
thirteenth      Milan    Italy  1350680         NaN               13

#### pandas.DataFrame.set_index*
DataFrame.set_index(keys, *, drop=True, append=False, inplace=False, verify_integrity=False)

In [115]:
df1 = city_df.set_index('a')
df1

                 b        c countryfwef  male-population
a
London     England  8615246         NaN                1
Berlin     Germany  3562166         NaN                2
Madrid       Spain  3165235         NaN                3
Rome         Italy  2874038         NaN                4
Paris       France  2273305         NaN                5
Vienna     Austria  1805681         NaN                6
Bucharest  Romania  1803425         NaN                7
Hamburg    Germany  1760433         NaN                8
Budapest   Hungary  1754000         NaN                9
Warsaw      Poland  1740119         NaN               10
Barcelona    Spain  1602386         NaN               11
Munich     Germany  1493900         NaN               12
Milan        Italy  1350680         NaN               13

#### index values로 ROWS 값 찾기

#### pandas.DataFrame.loc*
property DataFrame.loc

In [118]:
city_frame = pd.DataFrame(cities, columns=['name', 'population'], index = cities['country'])
city_frame

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [120]:
city_frame.loc["Germany"]

            name  population
Germany   Berlin     3562166
Germany  Hamburg     1760433
Germany   Munich     1493900

In [127]:
city_frame.loc[city_frame['population'] > 200000]

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary   Budapest     1754000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [132]:
city_frame.loc[(city_frame.population > 2000000) & (city_frame.population < 3000000)]

         name  population
Italy    Rome     2874038
France  Paris     2273305

In [137]:
city_frame.loc[(city_frame.population > 2000000) & city_frame['name'].str.contains("m")]

       name  population
Italy  Rome     2874038

In [138]:
city_frame.loc["Hungary"] = ["Seoul", 2100000]

In [139]:
city_frame

              name  population
England     London     8615246
Germany     Berlin     3562166
Spain       Madrid     3165235
Italy         Rome     2874038
France       Paris     2273305
Austria     Vienna     1805681
Romania  Bucharest     1803425
Germany    Hamburg     1760433
Hungary      Seoul     2100000
Poland      Warsaw     1740119
Spain    Barcelona     1602386
Germany     Munich     1493900
Italy        Milan     1350680

In [145]:
city_frame.loc["Germany", "population"]

Germany    3562166
Germany    1760433
Germany    1493900
Name: population, dtype: int64

#### ACCESSING ROWS VIA POSITION
* pandas.DataFrame.iloc

In [143]:
city_frame.iloc[2:5:2]

          name  population
Spain   Madrid     3165235
France   Paris     2273305

In [149]:
city_frame.iloc[0, 1]

8615246

In [153]:
city_frame.iloc[1:10:2, [1]]

         population
Germany     3562166
Italy       2874038
Austria     1805681
Germany     1760433
Poland      1740119

In [156]:
city_frame.iloc[1:6, [1]]

         population
Germany     3562166
Spain       3165235
Italy       2874038
France      2273305
Austria     1805681

#### SUM AND CUMULATIVE SUM

In [157]:
years = range(2014, 2019)
cities = ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken"]
shops = pd.DataFrame(index=years) # 빈 데이터 프레임 생성
for city in cities:
    shops.insert(loc=len(shops.columns),
    column=city,
    value=(np.random.uniform(0.7, 1, (5,)) * 1000).round(2))
print(shops)

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  709.32    792.53   962.12    952.01       904.47
2015  835.92    770.47   701.28    701.18       969.25
2016  867.82    868.72   976.80    973.44       943.45
2017  807.37    953.36   844.90    821.84       720.77
2018  841.81    748.19   724.17    958.36       763.78

#### pandas.DataFrame.sum*
DataFrame.sum(axis=None, skipna=True, numeric_only=False, min_count=0, **kwargs)

In [159]:
shops.sum()

Zürich         4062.24
Freiburg       4133.27
München        4209.27
Konstanz       4406.83
Saarbrücken    4301.72
dtype: float64

In [160]:
shops.sum(axis = 1)

2014    4320.45
2015    3978.10
2016    4630.23
2017    4148.24
2018    4036.31
dtype: float64

In [167]:
s = shops.iloc[:,[0,1,-1]]

In [168]:
s.sum()

Zürich         4062.24
Freiburg       4133.27
Saarbrücken    4301.72
dtype: float64

In [169]:
shops.cumsum(axis = 1)

      Zürich  Freiburg  München  Konstanz  Saarbrücken
2014  709.32   1501.85  2463.97   3415.98      4320.45
2015  835.92   1606.39  2307.67   3008.85      3978.10
2016  867.82   1736.54  2713.34   3686.78      4630.23
2017  807.37   1760.73  2605.63   3427.47      4148.24
2018  841.81   1590.00  2314.17   3272.53      4036.31

In [176]:
df = shops.reindex(columns= ["Zürich", "Freiburg", "München", "Konstanz", "Saarbrücken", "sum_Zurich"])
df["Zürich"].cumsum()

2014     709.32
2015    1545.24
2016    2413.06
2017    3220.43
2018    4062.24
Name: Zürich, dtype: float64

In [177]:
df["cumsum_Zurich"] = shops["Zürich"].cumsum()

In [178]:
df

,Zürich,Freiburg,München,Konstanz,Saarbrücken,sum_Zurich,cumsum_Zurich
2014,709.32,792.53,962.12,952.01,904.47,NaN,709.32
2015,835.92,770.47,701.28,701.18,969.25,NaN,1545.24
2016,867.82,868.72,976.80,973.44,943.45,NaN,2413.06
2017,807.37,953.36,844.90,821.84,720.77,NaN,3220.43
2018,841.81,748.19,724.17,958.36,763.78,NaN,4062.24

In [181]:
shops.iloc[:,:].cumsum()

       Zürich  Freiburg  München  Konstanz  Saarbrücken
2014   709.32    792.53   962.12    952.01       904.47
2015  1545.24   1563.00  1663.40   1653.19      1873.72
2016  2413.06   2431.72  2640.20   2626.63      2817.17
2017  3220.43   3385.08  3485.10   3448.47      3537.94
2018  4062.24   4133.27  4209.27   4406.83      4301.72

In [183]:
shops[["cumsum_Zurich", "cumsum_Freiburg", "cumsum_Munchen", "cumsum_Konstanz", "cumsum_Saarbrucken"]] = shops.iloc[:,:].cumsum()

In [184]:
shops

,Zürich,Freiburg,München,Konstanz,Saarbrücken,cumsum_Zurich,cumsum_Freiburg,cumsum_Munchen,cumsum_Konstanz,cumsum_Saarbrucken
2014,709.32,792.53,962.12,952.01,904.47,709.32,792.53,962.12,952.01,904.47
2015,835.92,770.47,701.28,701.18,969.25,1545.24,1563.00,1663.40,1653.19,1873.72
2016,867.82,868.72,976.80,973.44,943.45,2413.06,2431.72,2640.20,2626.63,2817.17
2017,807.37,953.36,844.90,821.84,720.77,3220.43,3385.08,3485.10,3448.47,3537.94
2018,841.81,748.19,724.17,958.36,763.78,4062.24,4133.27,4209.27,4406.83,4301.72

In [187]:
shops[["total_2014", "total_2015", "total_2016", "total_2017", "total_2018"]] = shops.iloc[:,0:5].cumsum(axis = 1)

In [188]:
shops

,Zürich,Freiburg,München,Konstanz,Saarbrücken,cumsum_Zurich,cumsum_Freiburg,cumsum_Munchen,cumsum_Konstanz,cumsum_Saarbrucken,total_2014,total_2015,total_2016,total_2017,total_2018
2014,709.32,792.53,962.12,952.01,904.47,709.32,792.53,962.12,952.01,904.47,709.32,1501.85,2463.97,3415.98,4320.45
2015,835.92,770.47,701.28,701.18,969.25,1545.24,1563.00,1663.40,1653.19,1873.72,835.92,1606.39,2307.67,3008.85,3978.10
2016,867.82,868.72,976.80,973.44,943.45,2413.06,2431.72,2640.20,2626.63,2817.17,867.82,1736.54,2713.34,3686.78,4630.23
2017,807.37,953.36,844.90,821.84,720.77,3220.43,3385.08,3485.10,3448.47,3537.94,807.37,1760.73,2605.63,3427.47,4148.24
2018,841.81,748.19,724.17,958.36,763.78,4062.24,4133.27,4209.27,4406.83,4301.72,841.81,1590.00,2314.17,3272.53,4036.31

In [195]:
shops["Sum of Year"] = shops.iloc[:, 0:5].sum(axis= 1)

In [196]:
shops["Mean of Year"] = shops.iloc[:, 0:5].mean(axis= 1)

In [197]:
shops

,Zürich,Freiburg,München,Konstanz,Saarbrücken,cumsum_Zurich,cumsum_Freiburg,cumsum_Munchen,cumsum_Konstanz,cumsum_Saarbrucken,total_2014,total_2015,total_2016,total_2017,total_2018,Mean of Year,Sum of Year
2014,709.32,792.53,962.12,952.01,904.47,709.32,792.53,962.12,952.01,904.47,709.32,1501.85,2463.97,3415.98,4320.45,864.090,4320.45
2015,835.92,770.47,701.28,701.18,969.25,1545.24,1563.00,1663.40,1653.19,1873.72,835.92,1606.39,2307.67,3008.85,3978.10,795.620,3978.10
2016,867.82,868.72,976.80,973.44,943.45,2413.06,2431.72,2640.20,2626.63,2817.17,867.82,1736.54,2713.34,3686.78,4630.23,926.046,4630.23
2017,807.37,953.36,844.90,821.84,720.77,3220.43,3385.08,3485.10,3448.47,3537.94,807.37,1760.73,2605.63,3427.47,4148.24,829.648,4148.24
2018,841.81,748.19,724.17,958.36,763.78,4062.24,4133.27,4209.27,4406.83,4301.72,841.81,1590.00,2314.17,3272.53,4036.31,807.262,4036.31

In [212]:
city_frame["Cum Of Population"] = city_frame["population"].cumsum()

In [213]:
city_frame

              name  population  Cum Of Population
England     London     8615246            8615246
Germany     Berlin     3562166           12177412
Spain       Madrid     3165235           15342647
Italy         Rome     2874038           18216685
France       Paris     2273305           20489990
Austria     Vienna     1805681           22295671
Romania  Bucharest     1803425           24099096
Germany    Hamburg     1760433           25859529
Hungary      Seoul     2100000           27959529
Poland      Warsaw     1740119           29699648
Spain    Barcelona     1602386           31302034
Germany     Munich     1493900           32795934
Italy        Milan     1350680           34146614

In [214]:
area = [1572, 891.85, 605.77, 1285, 105.4, 414.6, 228, 755, 525.2, 517, 101.9, 310.4, 181.8]
city_frame["area"] = area
city_frame

              name  population  Cum Of Population     area
England     London     8615246            8615246  1572.00
Germany     Berlin     3562166           12177412   891.85
Spain       Madrid     3165235           15342647   605.77
Italy         Rome     2874038           18216685  1285.00
France       Paris     2273305           20489990   105.40
Austria     Vienna     1805681           22295671   414.60
Romania  Bucharest     1803425           24099096   228.00
Germany    Hamburg     1760433           25859529   755.00
Hungary      Seoul     2100000           27959529   525.20
Poland      Warsaw     1740119           29699648   517.00
Spain    Barcelona     1602386           31302034   101.90
Germany     Munich     1493900           32795934   310.40
Italy        Milan     1350680           34146614   181.80

#### pandas.DataFrame.sort_values*
DataFrame.sort_values(by, *, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key=None)

In [219]:
city_frame.sort_values("area", ascending=False)

              name  population  Cum Of Population     area
England     London     8615246            8615246  1572.00
Italy         Rome     2874038           18216685  1285.00
Germany     Berlin     3562166           12177412   891.85
Germany    Hamburg     1760433           25859529   755.00
Spain       Madrid     3165235           15342647   605.77
Hungary      Seoul     2100000           27959529   525.20
Poland      Warsaw     1740119           29699648   517.00
Austria     Vienna     1805681           22295671   414.60
Germany     Munich     1493900           32795934   310.40
Romania  Bucharest     1803425           24099096   228.00
Italy        Milan     1350680           34146614   181.80
France       Paris     2273305           20489990   105.40
Spain    Barcelona     1602386           31302034   101.90

In [220]:
shops.T

                       2014     2015      2016      2017      2018
Zürich               709.32   835.92   867.820   807.370   841.810
Freiburg             792.53   770.47   868.720   953.360   748.190
München              962.12   701.28   976.800   844.900   724.170
Konstanz             952.01   701.18   973.440   821.840   958.360
Saarbrücken          904.47   969.25   943.450   720.770   763.780
cumsum_Zurich        709.32  1545.24  2413.060  3220.430  4062.240
cumsum_Freiburg      792.53  1563.00  2431.720  3385.080  4133.270
cumsum_Munchen       962.12  1663.40  2640.200  3485.100  4209.270
cumsum_Konstanz      952.01  1653.19  2626.630  3448.470  4406.830
cumsum_Saarbrucken   904.47  1873.72  2817.170  3537.940  4301.720
total_2014           709.32   835.92   867.820   807.370   841.810
total_2015          1501.85  1606.39  1736.540  1760.730  1590.000
total_2016          2463.97  2307.67  2713.340  2605.630  2314.170
total_2017          3415.98  3008.85  3686.780  3427.470  3272.530
total_2018          4320.45  3978.10  4630.230  4148.240  4036.310
Mean of Year         864.09   795.62   926.046   829.648   807.262
Sum of Year         4320.45  3978.10  4630.230  4148.240  4036.310

### ACCESSING AND CHANGING VALUES OF DATAFRAMES

In [269]:
first = ('Mike', 'Dorothee', 'Tom', 'Bill', 'Pete', 'Kate')
last = ('Meyer', 'Maier', 'Meyer', 'Mayer', 'Meyr', 'Mair')
job = ('data analyst', 'programmer', 'computer scientist', 'data scientist', 'accountant', 'psychiatrist')
language = ('Python', 'Perl', 'Java', 'Java', 'Cobol', 'Brainfuck')
df = pd.DataFrame(index = first, columns = ["last", "job", "language"])
df[["last", "job", "language"]] = list(zip(last, job, language))
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant      Cobol
Kate       Mair        psychiatrist  Brainfuck

#### CHANGE ONE VALUE IN DATAFRAME

#### pandas.DataFrame.replace
*DataFrame.replace(to_replace=None, value=_NoDefault.no_default, *, inplace=False, limit=None, regex=False, method=_NoDefault.no_default)

In [240]:
df = pd.DataFrame({'A': [0, 1, 2, 3, 4],
                   'B': [5, 6, 7, 8, 9],
                   'C': ['a', 'b', 'c', 'd', 'e']})
df.replace(0, 5)

   A  B  C
0  5  5  a
1  1  6  b
2  2  7  c
3  3  8  d
4  4  9  e

In [241]:
df.replace([0, 1, 2, 3], 4, inplace=True)
df

   A  B  C
0  4  5  a
1  4  6  b
2  4  7  c
3  4  8  d
4  4  9  e

In [242]:
df.replace(4,6)

   A  B  C
0  6  5  a
1  6  6  b
2  6  7  c
3  6  8  d
4  6  9  e

In [246]:
# Bill의 직업에 접근
df.iloc[3,1]
# Bill의 직업을 Data_Analyst로 변경
df.replace(df.iloc[3,1], "Data_Analyst")
df.replace(df.iloc[4,2], "Python")

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant     Python
Kate       Mair        psychiatrist  Brainfuck

In [257]:
df.iloc[3,1] = "Data_Analyst"

In [258]:
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer        Data_Analyst       Java
Pete       Meyr          accountant      Cobol
Kate       Mair        psychiatrist  Brainfuck

In [266]:
df = pd.DataFrame(index = last, columns = ["first", "job", "language"])
df[["first", "job", "language"]] = list(zip(first, job, language))
df.replace(["Mike", "Tom", df.iloc[1,2]], ["Michael", "Thomas", "Python"], inplace= True)
df

          first                 job   language
Meyer   Michael        data analyst     Python
Maier  Dorothee          programmer     Python
Meyer    Thomas  computer scientist       Java
Mayer      Bill      data scientist       Java
Meyr       Pete          accountant      Cobol
Mair       Kate        psychiatrist  Brainfuck

In [270]:
df.replace(['Cobol'], ["Pythen"], inplace=True)

In [271]:
df

           last                 job   language
Mike      Meyer        data analyst     Python
Dorothee  Maier          programmer       Perl
Tom       Meyer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete       Meyr          accountant     Pythen
Kate       Mair        psychiatrist  Brainfuck

#### USING REGULAR EXPRESSION

In [272]:
df.replace(to_replace=[r'M[ea][iy]e?r',r'P[iy]th[eo]n'], value = ["Mayer", "Python"], inplace= True, regex=True)

In [273]:
df

           last                 job   language
Mike      Mayer        data analyst     Python
Dorothee  Mayer          programmer       Perl
Tom       Mayer  computer scientist       Java
Bill      Mayer      data scientist       Java
Pete      Mayer          accountant     Python
Kate      Mayer        psychiatrist  Brainfuck

In [274]:
df = pd.DataFrame({
'name':['Ben', 'Kate', 'Agnes', 'Ashleigh', 'Tom'],
'job':['programmer', 'NN', 'NN', 'engineer', 'teacher'],
'language':['Java', 'Python', 'LN', 'LN', 'C']})
df

       name         job language
0       Ben  programmer     Java
1      Kate          NN   Python
2     Agnes          NN       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

In [279]:
df.replace(to_replace='NN',
           method='pad'
          )

       name         job language
0       Ben  programmer     Java
1      Kate  programmer   Python
2     Agnes  programmer       LN
3  Ashleigh    engineer       LN
4       Tom     teacher        C

In [280]:
df = pd.DataFrame([[1, 2], [4, 5], [7, 8]],
index=['cobra', 'viper', 'sidewinder'],
columns=['max_speed', 'shield'])

In [281]:
df

            max_speed  shield
cobra               1       2
viper               4       5
sidewinder          7       8

In [285]:
df[[False, False, True]]

            max_speed  shield
sidewinder          7       8

In [286]:
df['shield']>6

cobra         False
viper         False
sidewinder     True
Name: shield, dtype: bool

In [287]:
df.loc[df['shield']>6, 'max_speed']

sidewinder    7
Name: max_speed, dtype: int64

In [289]:
df.loc[lambda df : df['max_speed']>3] = 0

In [290]:
df

            max_speed  shield
cobra               1       2
viper               0       0
sidewinder          0       0

### GROUP BY

#### Group by With Series

In [291]:
nvalues = 30
values = np.random.randint(1, 20, (nvalues,))
fruits = ["bananas", "oranges", "apples", "clementines", "cherries", "pears"]
fruits_index = np.random.choice(fruits, (nvalues,))
s = pd.Series(values, index=fruits_index)

In [292]:
s

bananas        11
bananas         9
apples          2
pears           3
cherries       19
clementines    11
clementines     9
clementines    16
apples          3
oranges        14
clementines     9
clementines     5
pears          15
pears           7
apples         13
pears           6
bananas        19
clementines    10
pears          12
pears           7
oranges         8
bananas         5
oranges        14
cherries       19
cherries        1
bananas         3
pears           4
clementines     8
pears          14
apples         14
dtype: int32


Series.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, observed=False, dropna=True)

In [294]:
s.index

Index(['bananas', 'bananas', 'apples', 'pears', 'cherries', 'clementines',
       'clementines', 'clementines', 'apples', 'oranges', 'clementines',
       'clementines', 'pears', 'pears', 'apples', 'pears', 'bananas',
       'clementines', 'pears', 'pears', 'oranges', 'bananas', 'oranges',
       'cherries', 'cherries', 'bananas', 'pears', 'clementines', 'pears',
       'apples'],
      dtype='object')

In [295]:
grouped = s.groupby(s.index)

In [296]:
grouped

In [299]:
for fruit, s_obj in grouped:
    print(f"==============(fruit)===============")
    print(s_obj)

==============(fruit)===============
apples     2
apples     3
apples    13
apples    14
dtype: int32
==============(fruit)===============
bananas    11
bananas     9
bananas    19
bananas     5
bananas     3
dtype: int32
==============(fruit)===============
cherries    19
cherries    19
cherries     1
dtype: int32
==============(fruit)===============
clementines    11
clementines     9
clementines    16
clementines     9
clementines     5
clementines    10
clementines     8
dtype: int32
==============(fruit)===============
oranges    14
oranges     8
oranges    14
dtype: int32
==============(fruit)===============
pears     3
pears    15
pears     7
pears     6
pears    12
pears     7
pears     4
pears    14
dtype: int32

#### GROUPBY WITH DATAFRAME

In [300]:
beverages = pd.DataFrame({'Name': ['Robert', 'Melinda', 'Brenda', 'Samantha', 'Melinda', 'Robert', 'Melinda', 'Brenda', 'Samantha'],
'Coffee': [3, 0, 2, 2, 0, 2, 0, 1, 3],
'Tea': [0, 4, 2, 0, 3, 0, 3, 2, 0]})
beverages

       Name  Coffee  Tea
0    Robert       3    0
1   Melinda       0    4
2    Brenda       2    2
3  Samantha       2    0
4   Melinda       0    3
5    Robert       2    0
6   Melinda       0    3
7    Brenda       1    2
8  Samantha       3    0

#### pandas.DataFrame.groupby*
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, observed=False, dropna=True)

In [301]:
beverages.groupby(["Name"])
for i in beverages.groupby(["Name"]):
    print(len(i))

2
2
2
2

In [302]:
res = beverages.groupby(["Name"]).sum()
res

          Coffee  Tea
Name
Brenda         3    4
Melinda        0   10
Robert         5    0
Samantha       5    0

In [304]:
beverages.groupby(["Name"]).mean()

          Coffee       Tea
Name
Brenda       1.5  2.000000
Melinda      0.0  3.333333
Robert       2.5  0.000000
Samantha     2.5  0.000000

In [305]:
beverages.groupby(["Name"]).count()

          Coffee  Tea
Name
Brenda         2    2
Melinda        3    3
Robert         2    2
Samantha       2    2

In [315]:
from faker import Faker
import numpy as np
from itertools import chain
fake = Faker('de_DE')
number_of_names = 10
names = []
for _ in range(number_of_names):
    names.append(fake.first_name())
data = {}
workweek = ("Monday", "Tuesday", "Wednesday", "Thursday", "Friday")
weekend = ("Saturday", "Sunday")
for day in chain(workweek, weekend):
    data[day] = np.random.randint(0, 10, (number_of_names,))

data_df = pd.DataFrame(data, index=names)
data_df

           Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Wilfriede       1        6          7         8       4         1       4
Albin           6        2          0         9       5         7       4
Fatma           8        5          5         5       0         5       0
Martina         9        0          6         0       6         5       0
Leo             3        9          7         3       3         0       9
Leonie          5        1          5         6       4         6       4
Minna           6        6          0         6       7         9       3
Dunja           1        9          9         0       7         1       6
Zehra           3        4          5         3       6         5       8
Telse           0        0          2         0       7         1       2

In [318]:
def is_weekend(day):
    if day in ['Saturday', 'Sunday']:
        return "Weekend, Let's Party"
    else:
        return "Workday"
for res_func, df in data_df.groupby(by=is_weekend, axis = 1):
    print(df)

           Saturday  Sunday
Wilfriede         1       4
Albin             7       4
Fatma             5       0
Martina           5       0
Leo               0       9
Leonie            6       4
Minna             9       3
Dunja             1       6
Zehra             5       8
Telse             1       2
           Monday  Tuesday  Wednesday  Thursday  Friday
Wilfriede       1        6          7         8       4
Albin           6        2          0         9       5
Fatma           8        5          5         5       0
Martina         9        0          6         0       6
Leo             3        9          7         3       3
Leonie          5        1          5         6       4
Minna           6        6          0         6       7
Dunja           1        9          9         0       7
Zehra           3        4          5         3       6
Telse           0        0          2         0       7

In [319]:
data_df.groupby(by=is_weekend, axis = 1).sum()

           Weekend, Let's Party  Workday
Wilfriede                     5       26
Albin                        11       22
Fatma                         5       23
Martina                       5       21
Leo                           9       25
Leonie                       10       21
Minna                        12       25
Dunja                         7       26
Zehra                        13       21
Telse                         3        9

In [321]:
data_df.groupby(by=is_weekend, axis = 1).mean()

           Weekend, Let's Party  Workday
Wilfriede                   2.5      5.2
Albin                       5.5      4.4
Fatma                       2.5      4.6
Martina                     2.5      4.2
Leo                         4.5      5.0
Leonie                      5.0      4.2
Minna                       6.0      5.0
Dunja                       3.5      5.2
Zehra                       6.5      4.2
Telse                       1.5      1.8

In [322]:
data_df.groupby(by=is_weekend, axis = 1).count()

           Weekend, Let's Party  Workday
Wilfriede                     2        5
Albin                         2        5
Fatma                         2        5
Martina                       2        5
Leo                           2        5
Leonie                        2        5
Minna                         2        5
Dunja                         2        5
Zehra                         2        5
Telse                         2        5

In [323]:
def is_name_Leo(name):
    if name == "Leo":
        return "male"
    else :
        return "no access"
data_df.groupby(by=is_name_Leo).sum()

           Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
male            3        9          7         3       3         0       9
no access      39       33         39        37      46        40      31

In [324]:
data_df.groupby(by=is_name_Leo).mean()

,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday,Sunday
male,3.000000,9.000000,7.000000,3.000000,3.000000,0.000000,9.000000
no access,4.333333,3.666667,4.333333,4.111111,5.111111,4.444444,3.444444

In [325]:
for res_func, df in data_df.groupby(by=is_name_Leo):
    print(df)

     Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Leo       3        9          7         3       3         0       9
           Monday  Tuesday  Wednesday  Thursday  Friday  Saturday  Sunday
Wilfriede       1        6          7         8       4         1       4
Albin           6        2          0         9       5         7       4
Fatma           8        5          5         5       0         5       0
Martina         9        0          6         0       6         5       0
Leonie          5        1          5         6       4         6       4
Minna           6        6          0         6       7         9       3
Dunja           1        9          9         0       7         1       6
Zehra           3        4          5         3       6         5       8
Telse           0        0          2         0       7         1       2